In [1]:
import pandas as pd
import sqlalchemy

In [2]:
engine = sqlalchemy.create_engine('postgresql+psycopg2://postgres:****@localhost:5432/Sqltest')

In [2]:
%load_ext sql

### Для быстрого создания базы данный из .csv файла можно воспользоваться кодом ниже

In [37]:
df_1 = pd.read_csv('Spacex_dataset.csv', parse_dates=[0], dayfirst=True) # parse_dates=[0] указывает на столбец содержащий данные 
                                                                    #в формате "Date" для его правильного отображения в базе данных

In [38]:
for i in range(len(df_1.mission_outcome)):
    df_1.mission_outcome.iloc[i] = df_1.mission_outcome.iloc[i].strip(' ')

In [41]:
try:
    %sql DROP TABLE spacextbl
    print('Data base '"spacextbl"' was drop')
except:
    print('Data base '"spacextbl"' is not available')
try:
    df_1.to_sql('spacextbl', engine)
    print('Data base '"spacextbl"' was create')
except:
    print('Data base '"spacextbl"' wasn''t create')

 * postgresql://postgres:***@localhost:5432/Sqltest
Done.
Data base spacextbl was drop
Data base spacextbl was create

In [3]:
%sql postgresql://postgres:****@localhost:5432/Sqltest

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

### Task 1

##### Display the names of the unique launch sites  in the space mission

In [4]:
%%sql   SELECT DISTINCT launch_site	
        FROM spacextbl

 * postgresql://postgres:***@localhost:5432/Sqltest
4 rows affected.

[('KSC LC-39A',), ('CCAFS LC-40',), ('CCAFS SLC-40',), ('VAFB SLC-4E',)]

### Task 2

##### Display 5 records where launch sites begin with the string 'CCA'

In [5]:
%%sql   SELECT *
        FROM spacextbl
        WHERE launch_site LIKE 'CCA%'
        LIMIT 5

 * postgresql://postgres:***@localhost:5432/Sqltest
5 rows affected.

[(0, datetime.date(2010, 6, 4), '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 (1, datetime.date(2010, 12, 8), '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 (2, datetime.date(2012, 5, 22), '07:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 (3, datetime.date(2012, 10, 8), '00:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 (4, datetime.date(2013, 3, 1), '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

### Task 3

##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [6]:
%%sql   SELECT SUM(payload_mass_kg) AS total_payload_mass
        FROM spacextbl
        WHERE customer LIKE '%NASA (CRS)%'

 * postgresql://postgres:***@localhost:5432/Sqltest
1 rows affected.

[(Decimal('48213'),)]

### Task 4

##### Display average payload mass carried by booster version F9 v1.1

In [7]:
%%sql   SELECT AVG(payload_mass_kg) AS average_payload_mass
        FROM spacextbl
        WHERE booster_version LIKE '%F9%v1.1%'

 * postgresql://postgres:***@localhost:5432/Sqltest
1 rows affected.

[(Decimal('2534.6666666666666667'),)]

### Task 5

##### List the date when the first successful landing outcome in ground pad was acheived.

*Hint:Use min function*

In [8]:
%%sql   SELECT MIN(date) AS first_success_date
        FROM spacextbl
        WHERE landing_outcome LIKE '%Success%'

 * postgresql://postgres:***@localhost:5432/Sqltest
1 rows affected.

[(datetime.date(2015, 12, 22),)]

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [9]:
%%sql   SELECT booster_version, landing_outcome, payload_mass_kg 
        FROM spacextbl
        WHERE landing_outcome LIKE '%Success%drone%' AND payload_mass_kg BETWEEN 4000 AND 6000

 * postgresql://postgres:***@localhost:5432/Sqltest
4 rows affected.

[('F9 FT B1022', 'Success (drone ship)', 4696),
 ('F9 FT B1026', 'Success (drone ship)', 4600),
 ('F9 FT  B1021.2', 'Success (drone ship)', 5300),
 ('F9 FT  B1031.2', 'Success (drone ship)', 5200)]

### Task 7

##### List the total number of successful and failure mission outcomes

In [10]:
%%sql   SELECT mission_outcome, COUNT(mission_outcome) as total
        FROM spacextbl
        GROUP BY mission_outcome

 * postgresql://postgres:***@localhost:5432/Sqltest
3 rows affected.

[('Success (payload status unclear)', 1),
 ('Success', 99),
 ('Failure (in flight)', 1)]

### Task 8

##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [12]:
%%sql   SELECT DISTINCT(booster_version), payload_mass_kg
        FROM spacextbl
        WHERE payload_mass_kg IN (SELECT MAX(payload_mass_kg)
                                        FROM spacextbl)

 * postgresql://postgres:***@localhost:5432/Sqltest
12 rows affected.

[('F9 B5 B1048.4', 15600),
 ('F9 B5 B1048.5', 15600),
 ('F9 B5 B1049.4', 15600),
 ('F9 B5 B1049.5', 15600),
 ('F9 B5 B1049.7 ', 15600),
 ('F9 B5 B1051.3', 15600),
 ('F9 B5 B1051.4', 15600),
 ('F9 B5 B1051.6', 15600),
 ('F9 B5 B1056.4', 15600),
 ('F9 B5 B1058.3 ', 15600),
 ('F9 B5 B1060.2 ', 15600),
 ('F9 B5 B1060.3', 15600)]

### Task 9

##### List the failed landing_outcomes in drone ship, their booster versions, and launch site names for in year 2015

In [79]:
%%sql   SELECT booster_version, launch_site, date, landing_outcome
        FROM spacextbl
        WHERE landing_outcome LIKE '%Failure%drone%' AND date BETWEEN '2014-12-31' AND '2016-01-01'

 * postgresql://postgres:***@localhost:5432/Sqltest
2 rows affected.

[('F9 v1.1 B1012', 'CCAFS LC-40', datetime.date(2015, 1, 10), 'Failure (drone ship)'),
 ('F9 v1.1 B1015', 'CCAFS LC-40', datetime.date(2015, 4, 14), 'Failure (drone ship)')]

### Task 10

##### Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order

In [52]:
%%sql   SELECT landing_outcome, COUNT(mission_outcome) AS total
        FROM spacextbl
        WHERE date BETWEEN '2010-04-06' AND '2017-03-20'
        GROUP BY landing_outcome 
        ORDER BY total DESC

 * postgresql://postgres:***@localhost:5432/Sqltest
8 rows affected.

[('No attempt', 10),
 ('Success (drone ship)', 5),
 ('Failure (drone ship)', 5),
 ('Success (ground pad)', 3),
 ('Controlled (ocean)', 3),
 ('Uncontrolled (ocean)', 2),
 ('Failure (parachute)', 2),
 ('Precluded (drone ship)', 1)]